nevinxu/HM502B2/platform/CMSIS/Include/device/MKL27Z4/MKL27Z4_flexio.h
#define HW_FLEXIO_SHIFTBUFBYSn_ADDR(x, n) ((x) + 0x300U + (0x4U * (n)))

#define HW_FLEXIO_SHIFTBUFBYSn(x, n) (*(__IO hw_flexio_shiftbufbysn_t *) HW_FLEXIO_SHIFTBUFBYSn_ADDR(x, n))
#define HW_FLEXIO_SHIFTBUFBYSn_RD(x, n) (HW_FLEXIO_SHIFTBUFBYSn(x, n).U)
#define HW_FLEXIO_SHIFTBUFBYSn_WR(x, n, v) (HW_FLEXIO_SHIFTBUFBYSn(x, n).U = (v))
#define HW_FLEXIO_SHIFTBUFBYSn_SET(x, n, v) (BME_OR32(HW_FLEXIO_SHIFTBUFBYSn_ADDR(x, n), (uint32_t)(v)))
#define HW_FLEXIO_SHIFTBUFBYSn_CLR(x, n, v) (BME_AND32(HW_FLEXIO_SHIFTBUFBYSn_ADDR(x, n), (uint32_t)(~(v))))
#define HW_FLEXIO_SHIFTBUFBYSn_TOG(x, n, v) (BME_XOR32(HW_FLEXIO_SHIFTBUFBYSn_ADDR(x, n), (uint32_t)(v)))
/*@}*/

/*
 * Constants & macros for individual FLEXIO_SHIFTBUFBYSn bitfields
 */

/*!
 * @name Register FLEXIO_SHIFTBUFBYSn, field SHIFTBUFBYS[31:0] (RW)
 *
 * Alias to SHIFTBUF register, except reads/writes to this register are byte
 * swapped. Reads return { SHIFTBUF[7:0], SHIFTBUF[15:8], SHIFTBUF[23:16],
 * SHIFTBUF[31:24] }.
 */
/*@{*/
#define BP_FLEXIO_SHIFTBUFBYSn_SHIFTBUFBYS (0U) /*!< Bit position for FLEXIO_SHIFTBUFBYSn_SHIFTBUFBYS. */
#define BM_FLEXIO_SHIFTBUFBYSn_SHIFTBUFBYS (0xFFFFFFFFU) /*!< Bit mask for FLEXIO_SHIFTBUFBYSn_SHIFTBUFBYS. */
#define BS_FLEXIO_SHIFTBUFBYSn_SHIFTBUFBYS (32U) /*!< Bit field size in bits for FLEXIO_SHIFTBUFBYSn_SHIFTBUFBYS. */

/*! @brief Read current value of the FLEXIO_SHIFTBUFBYSn_SHIFTBUFBYS field. */
#define BR_FLEXIO_SHIFTBUFBYSn_SHIFTBUFBYS(x, n) (HW_FLEXIO_SHIFTBUFBYSn(x, n).U)

/*! @brief Format value for bitfield FLEXIO_SHIFTBUFBYSn_SHIFTBUFBYS. */
#define BF_FLEXIO_SHIFTBUFBYSn_SHIFTBUFBYS(v) ((uint32_t)((uint32_t)(v) << BP_FLEXIO_SHIFTBUFBYSn_SHIFTBUFBYS) & BM_FLEXIO_SHIFTBUFBYSn_SHIFTBUFBYS)

/*! @brief Set the SHIFTBUFBYS field to a new value. */
#define BW_FLEXIO_SHIFTBUFBYSn_SHIFTBUFBYS(x, n, v) (HW_FLEXIO_SHIFTBUFBYSn_WR(x, n, v))
/*@}*/

/*******************************************************************************
 * HW_FLEXIO_SHIFTBUFBISn - Shifter Buffer N Bit Swapped Register
 ******************************************************************************/

/*!
 * @brief HW_FLEXIO_SHIFTBUFBISn - Shifter Buffer N Bit Swapped Register (RW)
 *
 * Reset value: 0x00000000U
 *
 * .
 */
typedef union _hw_flexio_shiftbufbisn
{
    uint32_t U;
    struct _hw_flexio_shiftbufbisn_bitfields
    {
        uint32_t SHIFTBUFBIS : 32;     /*!< [31:0] Shift Buffer */
    } B;
} hw_flexio_shiftbufbisn_t;

/*!
 * @name Constants and macros for entire FLEXIO_SHIFTBUFBISn register
 */
/*@{*/
#define HW_FLEXIO_SHIFTBUFBISn_COUNT (4U)

#define HW_FLEXIO_SHIFTBUFBISn_ADDR(x, n) ((x) + 0x380U + (0x4U * (n)))

#define HW_FLEXIO_SHIFTBUFBISn(x, n) (*(__IO hw_flexio_shiftbufbisn_t *) HW_FLEXIO_SHIFTBUFBISn_ADDR(x, n))
#define HW_FLEXIO_SHIFTBUFBISn_RD(x, n) (HW_FLEXIO_SHIFTBUFBISn(x, n).U)
#define HW_FLEXIO_SHIFTBUFBISn_WR(x, n, v) (HW_FLEXIO_SHIFTBUFBISn(x, n).U = (v))
#define HW_FLEXIO_SHIFTBUFBISn_SET(x, n, v) (BME_OR32(HW_FLEXIO_SHIFTBUFBISn_ADDR(x, n), (uint32_t)(v)))
#define HW_FLEXIO_SHIFTBUFBISn_CLR(x, n, v) (BME_AND32(HW_FLEXIO_SHIFTBUFBISn_ADDR(x, n), (uint32_t)(~(v))))
#define HW_FLEXIO_SHIFTBUFBISn_TOG(x, n, v) (BME_XOR32(HW_FLEXIO_SHIFTBUFBISn_ADDR(x, n), (uint32_t)(v)))
/*@}*/

/*
 * Constants & macros for individual FLEXIO_SHIFTBUFBISn bitfields
 */

/*!
 * @name Register FLEXIO_SHIFTBUFBISn, field SHIFTBUFBIS[31:0] (RW)
 *
 * Alias to SHIFTBUF register, except reads/writes to this register are bit
 * swapped. Reads return SHIFTBUF[0:31].
 */
/*@{*/
#define BP_FLEXIO_SHIFTBUFBISn_SHIFTBUFBIS (0U) /*!< Bit position for FLEXIO_SHIFTBUFBISn_SHIFTBUFBIS. */
#define BM_FLEXIO_SHIFTBUFBISn_SHIFTBUFBIS (0xFFFFFFFFU) /*!< Bit mask for FLEXIO_SHIFTBUFBISn_SHIFTBUFBIS. */
#define BS_FLEXIO_SHIFTBUFBISn_SHIFTBUFBIS (32U) /*!< Bit field size in bits for FLEXIO_SHIFTBUFBISn_SHIFTBUFBIS. */

/*! @brief Read current value of the FLEXIO_SHIFTBUFBISn_SHIFTBUFBIS field. */
#define BR_FLEXIO_SHIFTBUFBISn_SHIFTBUFBIS(x, n) (HW_FLEXIO_SHIFTBUFBISn(x, n).U)

/*! @brief Format value for bitfield FLEXIO_SHIFTBUFBISn_SHIFTBUFBIS. */
#define BF_FLEXIO_SHIFTBUFBISn_SHIFTBUFBIS(v) ((uint32_t)((uint32_t)(v) << BP_FLEXIO_SHIFTBUFBISn_SHIFTBUFBIS) & BM_FLEXIO_SHIFTBUFBISn_SHIFTBUFBIS)

/*! @brief Set the SHIFTBUFBIS field to a new value. */
#define BW_FLEXIO_SHIFTBUFBISn_SHIFTBUFBIS(x, n, v) (HW_FLEXIO_SHIFTBUFBISn_WR(x, n, v))
/*@}*/

/*******************************************************************************
 * HW_FLEXIO_TIMCTLn - Timer Control N Register
 ******************************************************************************/

/*!
 * @brief HW_FLEXIO_TIMCTLn - Timer Control N Register (RW)
 *
 * Reset value: 0x00000000U
 *
 * .
 */
typedef union _hw_flexio_timctln
{
    uint32_t U;
    struct _hw_flexio_timctln_bitfields
    {
        uint32_t TIMOD : 2;            /*!< [1:0] Timer Mode */
        uint32_t RESERVED0 : 5;        /*!< [6:2]  */
        uint32_t PINPOL : 1;           /*!< [7] Timer Pin Polarity */
        uint32_t PINSEL : 3;           /*!< [10:8] Timer Pin Select */
        uint32_t RESERVED1 : 5;        /*!< [15:11]  */
        uint32_t PINCFG : 2;           /*!< [17:16] Timer Pin Configuration */
        uint32_t RESERVED2 : 4;        /*!< [21:18]  */
        uint32_t TRGSRC : 1;           /*!< [22] Trigger Source */
        uint32_t TRGPOL : 1;           /*!< [23] Trigger Polarity */
        uint32_t TRGSEL : 4;           /*!< [27:24] Trigger Select */
        uint32_t RESERVED3 : 4;        /*!< [31:28]  */
    } B;
} hw_flexio_timctln_t;

/*!
 * @name Constants and macros for entire FLEXIO_TIMCTLn register
 */
/*@{*/
#define HW_FLEXIO_TIMCTLn_COUNT (4U)

#define HW_FLEXIO_TIMCTLn_ADDR(x, n) ((x) + 0x400U + (0x4U * (n)))

#define HW_FLEXIO_TIMCTLn(x, n)  (*(__IO hw_flexio_timctln_t *) HW_FLEXIO_TIMCTLn_ADDR(x, n))
#define HW_FLEXIO_TIMCTLn_RD(x, n) (HW_FLEXIO_TIMCTLn(x, n).U)
#define HW_FLEXIO_TIMCTLn_WR(x, n, v) (HW_FLEXIO_TIMCTLn(x, n).U = (v))
#define HW_FLEXIO_TIMCTLn_SET(x, n, v) (BME_OR32(HW_FLEXIO_TIMCTLn_ADDR(x, n), (uint32_t)(v)))
#define HW_FLEXIO_TIMCTLn_CLR(x, n, v) (BME_AND32(HW_FLEXIO_TIMCTLn_ADDR(x, n), (uint32_t)(~(v))))
#define HW_FLEXIO_TIMCTLn_TOG(x, n, v) (BME_XOR32(HW_FLEXIO_TIMCTLn_ADDR(x, n), (uint32_t)(v)))
/*@}*/

